Import Libraries

In [1]:
import pandas as pd
import numpy as np

Read CSV File

In [2]:
df = pd.read_csv("username-password-recovery-code.csv", delimiter= ';')
df

,Username,Identifier,One-time password,Recovery code,First name,Last name,Department,Location
0,booker12,9012,12se74,rb9012,Rachel,Booker,Sales,Manchester
1,grey07,2070,04ap67,lg2070,Laura,Grey,Depot,London
2,johnson81,4081,30no86,cj4081,Craig,Johnson,Depot,London
3,jenkins46,9346,14ju73,mj9346,Mary,Jenkins,Engineering,Manchester
4,smith79,5079,09ja61,js5079,Jamie,Smith,Engineering,Manchester

Check whethere there is a missing data

In [3]:
df.isnull().sum()

Username             0
 Identifier          0
One-time password    0
Recovery code        0
First name           0
Last name            0
Department           0
Location             0
dtype: int64

Rename the Column's name

In [4]:
df.rename(columns={'One-time password': 'One-timePassword', 'Recovery code': 'RecoveryCode',
                  'First name': 'FirstName', 'Last name': 'LastName'}, inplace=True)
df

,Username,Identifier,One-timePassword,RecoveryCode,FirstName,LastName,Department,Location
0,booker12,9012,12se74,rb9012,Rachel,Booker,Sales,Manchester
1,grey07,2070,04ap67,lg2070,Laura,Grey,Depot,London
2,johnson81,4081,30no86,cj4081,Craig,Johnson,Depot,London
3,jenkins46,9346,14ju73,mj9346,Mary,Jenkins,Engineering,Manchester
4,smith79,5079,09ja61,js5079,Jamie,Smith,Engineering,Manchester

Convert a word into small letter

In [5]:
lower = df.FirstName.str.lower()
lower

0    rachel
1     laura
2     craig
3      mary
4     jamie
Name: FirstName, dtype: object

In [6]:
capitalize = df.FirstName.str.capitalize()
capitalize

0    Rachel
1     Laura
2     Craig
3      Mary
4     Jamie
Name: FirstName, dtype: object